In [1]:
import pandas as pd
import numpy as np

In [2]:
ser = pd.Series()

In [3]:
ser

Series([], dtype: object)

In [4]:
ser1 = pd.Series([1,2,3,4,5,6])

In [5]:
ser1

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [6]:
df = pd.DataFrame()

In [7]:
df

Empty DataFrame
Columns: []
Index: []

In [8]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [9]:
data = ['Geeks', 'For', 'Geeks', 'is', 'portal', 'for', 'Geeks']

In [10]:
df = pd.DataFrame(data)

In [11]:
df

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [12]:
data = np.array([[1,2,3],[4,5,6], [7,8,9]])
df = pd.DataFrame(data, columns=['a', 'b','c'])
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [13]:
data = {"name": ["aparna", "pankaj", "sudhir", "Geeku"], "degree": ["MBA", "BCA", "M.Tech", "MBA"], "score": [90, 40, 80, 98]}
df = pd.DataFrame(data)
df

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [14]:
data = np.array(['a', 'b', 'c', 'd', 'e'])
ser = pd.Series(data)
ser[:3]

0    a
1    b
2    c
dtype: object

In [15]:
data = np.array(['a', 'b', 'c', 'd', 'e'])
ser = pd.Series(data, index=[11,12,13,14,15])
ser

11    a
12    b
13    c
14    d
15    e
dtype: object

In [16]:
df = pd.read_csv("../../datasets/Zomato-data.csv")
ser = pd.Series(df["name"])
sub_ser = ser.head(10)
sub_ser

0                                              Jalsa
1                                     Spice Elephant
2                                    San Churro Cafe
3                              Addhuri Udupi Bhojana
4                                      Grand Village
5                                    Timepass Dinner
6    Rosewood International Hotel - Bar & Restaurant
7                                             Onesta
8                                     Penthouse Cafe
9                                          Smacznego
Name: name, dtype: object

In [17]:
sub_ser.loc[2:4]

2          San Churro Cafe
3    Addhuri Udupi Bhojana
4            Grand Village
Name: name, dtype: object

In [18]:
sub_ser.iloc[2:4]

2          San Churro Cafe
3    Addhuri Udupi Bhojana
Name: name, dtype: object

In [19]:
ser1 = pd.Series([1,2,3], index=['a', 'b', 'c'])
ser2 = pd.Series([4,5,6], index=['a', 'b', 'c'])
ser1.add(ser2)

a    5
b    7
c    9
dtype: int64

In [20]:
ser1.astype(float)

a    1.0
b    2.0
c    3.0
dtype: float64

In [21]:
data = {"a": 1, "b": 2, "c": 3}
ser = pd.Series(data)
ser

a    1
b    2
c    3
dtype: int64

In [22]:
df = pd.DataFrame(data, index=[11,12,13])
df

    a  b  c
11  1  2  3
12  1  2  3
13  1  2  3

In [23]:
ser = pd.Series(np.linspace(1,10,5))
ser

0     1.00
1     3.25
2     5.50
3     7.75
4    10.00
dtype: float64

In [24]:
ser = pd.Series(range(5, 15))
ser

0     5
1     6
2     7
3     8
4     9
5    10
6    11
7    12
8    13
9    14
dtype: int64

In [25]:
ser = pd.Series(range(1,20,3), index=[x for x in 'abcdefg'])
ser

a     1
b     4
c     7
d    10
e    13
f    16
g    19
dtype: int64

In [26]:
df = pd.read_csv('../../datasets/nba.csv')
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,NaN,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,NaN,6-10,231.0,NaN,5000000.0

In [27]:
ser = df["Name"]
ser.head(7)

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
6    Jordan Mickey
Name: Name, dtype: object

In [28]:
df[['Name', 'Salary']].head()

            Name     Salary
0  Avery Bradley  7730337.0
1    Jae Crowder  6796117.0
2   John Holland        NaN
3    R.J. Hunter  1148640.0
4  Jonas Jerebko  5000000.0

In [29]:
sorted_data = df.sort_values(by='Age', ascending=True)

In [30]:
sorted_data.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
122,Devin Booker,Phoenix Suns,1.0,SG,19.0,6-6,206.0,Kentucky,2127840.0
226,Rashad Vaughn,Milwaukee Bucks,20.0,SG,19.0,6-6,202.0,UNLV,1733040.0
410,Karl-Anthony Towns,Minnesota Timberwolves,32.0,C,20.0,7-0,244.0,Kentucky,5703600.0
427,Cliff Alexander,Portland Trail Blazers,34.0,PF,20.0,6-8,240.0,Kansas,525093.0
393,Emmanuel Mudiay,Denver Nuggets,0.0,PG,20.0,6-5,200.0,NaN,3102240.0

In [31]:
df.tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [32]:
df.tail(100)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
358,Ersan Ilyasova,Orlando Magic,7.0,PF,29.0,6-10,235.0,NaN,7900000.0
359,Brandon Jennings,Orlando Magic,55.0,PG,26.0,6-1,169.0,NaN,8344497.0
360,Devyn Marble,Orlando Magic,11.0,SF,23.0,6-6,200.0,Iowa,845059.0
361,Shabazz Napier,Orlando Magic,13.0,PG,24.0,6-1,175.0,Connecticut,1294440.0
362,Andrew Nicholson,Orlando Magic,44.0,PF,26.0,6-9,250.0,St. Bonaventure,2380593.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [33]:
ser = df['Salary']
ser.tail(7)

451     981348.0
452    2239800.0
453    2433333.0
454     900000.0
455    2900000.0
456     947276.0
457          NaN
Name: Salary, dtype: float64

In [34]:
n_s = df[['Name', 'Salary']]
n_s.tail()

             Name     Salary
453  Shelvin Mack  2433333.0
454     Raul Neto   900000.0
455  Tibor Pleiss  2900000.0
456   Jeff Withey   947276.0
457           NaN        NaN

In [35]:
s_d = df.sort_values(by='Age', ascending=True)
s_d.tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
298,Tim Duncan,San Antonio Spurs,21.0,C,40.0,6-11,250.0,Wake Forest,5250000.0
304,Andre Miller,San Antonio Spurs,24.0,PG,40.0,6-3,200.0,Utah,250750.0
400,Kevin Garnett,Minnesota Timberwolves,21.0,PF,40.0,6-11,240.0,NaN,8500000.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,NaN,6-10,231.0,NaN,5000000.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [36]:
s_d = df[['Name', 'Age', 'Weight']].sort_values(by='Age', ascending=True).head()
s_d

                   Name   Age  Weight
122        Devin Booker  19.0   206.0
226       Rashad Vaughn  19.0   202.0
410  Karl-Anthony Towns  20.0   244.0
427     Cliff Alexander  20.0   240.0
393     Emmanuel Mudiay  20.0   200.0

In [37]:
df.describe()

           Number         Age      Weight        Salary
count  457.000000  456.000000  457.000000  4.460000e+02
mean    17.678337   26.934211  221.522976  4.842684e+06
std     15.966090    4.407792   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      456 non-null    object
 2   Number    457 non-null    float64
 3   Position  456 non-null    object
 4   Age       456 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [39]:
df.describe(percentiles=[.20, .40, .60, .80], include=['object', 'float', 'int'])

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
count,457,456,457.000000,456,456.000000,457,457.000000,373,4.460000e+02
unique,457,30,NaN,5,NaN,18,NaN,118,NaN
top,Avery Bradley,New Orleans Pelicans,NaN,SG,NaN,6-9,NaN,Kentucky,NaN
freq,1,19,NaN,101,NaN,59,NaN,22,NaN
mean,NaN,NaN,17.678337,NaN,26.934211,NaN,221.522976,NaN,4.842684e+06
std,NaN,NaN,15.966090,NaN,4.407792,NaN,26.368343,NaN,5.229238e+06
min,NaN,NaN,0.000000,NaN,19.000000,NaN,161.000000,NaN,3.088800e+04
20%,NaN,NaN,4.000000,NaN,23.000000,NaN,195.600000,NaN,9.472760e+05
40%,NaN,NaN,10.000000,NaN,25.000000,NaN,213.400000,NaN,1.938840e+06
50%,NaN,NaN,13.000000,NaN,26.000000,NaN,220.000000,NaN,2.839073e+06
60%,NaN,NaN,18.600000,NaN,27.000000,NaN,230.000000,NaN,3.815000e+06
80%,NaN,NaN,30.000000,NaN,30.000000,NaN,245.000000,NaN,8.042895e+06
max,NaN,NaN,99.000000,NaN,40.000000,NaN,307.000000,NaN,2.500000e+07

In [40]:
df['Name'].describe()

count               457
unique              457
top       Avery Bradley
freq                  1
Name: Name, dtype: object

In [41]:
df['Salary'].describe()

count    4.460000e+02
mean     4.842684e+06
std      5.229238e+06
min      3.088800e+04
25%      1.044792e+06
50%      2.839073e+06
75%      6.500000e+06
max      2.500000e+07
Name: Salary, dtype: float64

In [42]:
df.describe(include='all')

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
count,457,456,457.000000,456,456.000000,457,457.000000,373,4.460000e+02
unique,457,30,NaN,5,NaN,18,NaN,118,NaN
top,Avery Bradley,New Orleans Pelicans,NaN,SG,NaN,6-9,NaN,Kentucky,NaN
freq,1,19,NaN,101,NaN,59,NaN,22,NaN
mean,NaN,NaN,17.678337,NaN,26.934211,NaN,221.522976,NaN,4.842684e+06
std,NaN,NaN,15.966090,NaN,4.407792,NaN,26.368343,NaN,5.229238e+06
min,NaN,NaN,0.000000,NaN,19.000000,NaN,161.000000,NaN,3.088800e+04
25%,NaN,NaN,5.000000,NaN,24.000000,NaN,200.000000,NaN,1.044792e+06
50%,NaN,NaN,13.000000,NaN,26.000000,NaN,220.000000,NaN,2.839073e+06
75%,NaN,NaN,25.000000,NaN,30.000000,NaN,240.000000,NaN,6.500000e+06
max,NaN,NaN,99.000000,NaN,40.000000,NaN,307.000000,NaN,2.500000e+07

In [43]:
data = {"Name": ["Jai", "Princi", "Gaurav", "anuj"], "Age": [27, 24, 22, 32], "Address": ["Delhi", "Kanpur", "Allahabad", "Kannauj"], "Qualification": ["Msc", "MA", "MCA", "Phd"]}
df = pd.DataFrame(data)
df[["Name", "Qualification"]]

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    anuj           Phd

In [44]:
address = ["Delhi", "Bangalore", "Chennai", "Patna"]
df["Address"] = address
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24  Bangalore            MA
2  Gaurav   22    Chennai           MCA
3    anuj   32      Patna           Phd

In [45]:
df.drop("Address", axis=1)

     Name  Age Qualification
0     Jai   27           Msc
1  Princi   24            MA
2  Gaurav   22           MCA
3    anuj   32           Phd

In [46]:
df = pd.read_csv('../../datasets/nba.csv')
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,NaN,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,NaN,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [47]:
df.drop(["Team", "Weight"], axis = 1, inplace=True)

In [48]:
df = pd.read_csv('../../datasets/nba.csv', index_col="Name")
df

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,NaN,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,NaN,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [49]:
df.loc[["Avery Bradley", 'R.J. Hunter']]

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
R.J. Hunter,Boston Celtics,28.0,NaN,22.0,6-5,185.0,Georgia State,1148640.0

In [50]:
df = pd.read_csv('../../datasets/nba.csv', index_col="Team")
df.loc["Utah Jazz"]

,Name,Number,Position,Age,Height,Weight,College,Salary
Team,,,,,,,,
Utah Jazz,Trevor Booker,33.0,PF,28.0,6-8,228.0,Clemson,4775000.0
Utah Jazz,Trey Burke,3.0,PG,23.0,6-1,191.0,Michigan,2658240.0
Utah Jazz,Alec Burks,10.0,SG,24.0,6-6,214.0,Colorado,9463484.0
Utah Jazz,Dante Exum,11.0,PG,20.0,6-6,190.0,NaN,3777720.0
Utah Jazz,Derrick Favors,15.0,PF,24.0,6-10,265.0,Georgia Tech,12000000.0
Utah Jazz,Rudy Gobert,27.0,C,23.0,7-1,245.0,NaN,1175880.0
Utah Jazz,Gordon Hayward,20.0,SF,26.0,6-8,226.0,Butler,15409570.0
Utah Jazz,Rodney Hood,5.0,SG,23.0,6-8,206.0,Duke,1348440.0
Utah Jazz,Joe Ingles,2.0,SF,28.0,6-8,226.0,NaN,2050000.0
Utah Jazz,Chris Johnson,23.0,SF,26.0,6-6,206.0,Dayton,981348.0
Utah Jazz,Trey Lyles,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
Utah Jazz,Shelvin Mack,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Utah Jazz,Raul Neto,25.0,PG,24.0,6-1,179.0,NaN,900000.0
Utah Jazz,Tibor Pleiss,21.0,C,26.0,7-3,256.0,NaN,2900000.0
Utah Jazz,Jeff Withey,24.0,C,26.0,7-0,231.0,Kansas,947276.0

In [51]:
df = pd.read_csv('../../datasets/nba.csv', index_col="Name")
df.loc["Avery Bradley":"Isaiah Thomas"]

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,NaN,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,NaN,6-10,231.0,NaN,5000000.0
Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0
Jared Sullinger,Boston Celtics,7.0,C,24.0,6-9,260.0,Ohio State,2569260.0
Isaiah Thomas,Boston Celtics,4.0,PG,27.0,5-9,185.0,Washington,6912869.0

In [52]:
df = pd.read_csv('../../datasets/nba.csv')
df.loc[3] == df.iloc[3]

Name         True
Team         True
Number       True
Position    False
Age          True
Height       True
Weight       True
College      True
Salary       True
Name: 3, dtype: bool

In [53]:
df.iloc[[4,5,6,7]] == df.iloc[4:8]

   Name  Team  Number  Position    Age  Height  Weight  College  Salary
4  True  True    True      True  False    True    True    False    True
5  True  True    True      True   True    True    True    False    True
6  True  True    True      True   True    True    True     True    True
7  True  True    True      True   True    True    True     True    True

In [54]:
df.iloc[4:8]

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
4,Jonas Jerebko,Boston Celtics,8.0,PF,NaN,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0

In [55]:
df = pd.DataFrame({"Name": ["Geek1", "Geek2", "Geek3", "Geek4", "Geek5"], "Age": [25, 30, 22, 35, 28], "Salary": [50000, 60000, 45000, 70000, 55000]})
df.set_index('Name', inplace=True)
df

       Age  Salary
Name
Geek1   25   50000
Geek2   30   60000
Geek3   22   45000
Geek4   35   70000
Geek5   28   55000

In [56]:
df.iloc[0, :]

Age          25
Salary    50000
Name: Geek1, dtype: int64

In [57]:
df.iloc[1:3, :]

       Age  Salary
Name
Geek2   30   60000
Geek3   22   45000

In [58]:
df = pd.read_csv('../../datasets/nba.csv', index_col='Name')
df.head(5)

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,NaN,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,NaN,6-10,231.0,NaN,5000000.0

In [59]:
df["Age"]

Name
Avery Bradley    25.0
Jae Crowder      25.0
John Holland     27.0
R.J. Hunter      22.0
Jonas Jerebko     NaN
                 ...
Shelvin Mack     26.0
Raul Neto        24.0
Tibor Pleiss     26.0
Jeff Withey      26.0
NaN               NaN
Name: Age, Length: 458, dtype: float64

In [60]:
df1 = df[["Age", "College", "Salary"]]

In [61]:
df1.head()

                Age            College     Salary
Name
Avery Bradley  25.0              Texas  7730337.0
Jae Crowder    25.0          Marquette  6796117.0
John Holland   27.0  Boston University        NaN
R.J. Hunter    22.0      Georgia State  1148640.0
Jonas Jerebko   NaN                NaN  5000000.0

In [62]:
df.loc["Avery Bradley"]

Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Height                 6-2
Weight               180.0
College              Texas
Salary           7730337.0
Name: Avery Bradley, dtype: object

In [63]:
df.loc[["Avery Bradley", "R.J. Hunter"]]

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
R.J. Hunter,Boston Celtics,28.0,NaN,22.0,6-5,185.0,Georgia State,1148640.0

In [64]:
df.loc[["Avery Bradley", "R.J. Hunter"],["Team", "Number", "Position"]]

                         Team  Number Position
Name
Avery Bradley  Boston Celtics     0.0       PG
R.J. Hunter    Boston Celtics    28.0      NaN

In [65]:
df.loc[:, ["Team", "Position", "Salary"]]

                         Team Position     Salary
Name
Avery Bradley  Boston Celtics       PG  7730337.0
Jae Crowder    Boston Celtics       SF  6796117.0
John Holland   Boston Celtics       SG        NaN
R.J. Hunter    Boston Celtics      NaN  1148640.0
Jonas Jerebko  Boston Celtics       PF  5000000.0
...                       ...      ...        ...
Shelvin Mack        Utah Jazz       PG  2433333.0
Raul Neto           Utah Jazz       PG   900000.0
Tibor Pleiss        Utah Jazz        C  2900000.0
Jeff Withey         Utah Jazz        C   947276.0
NaN                       NaN      NaN        NaN

[458 rows x 3 columns]

In [66]:
df.iloc[3]

Team        Boston Celtics
Number                28.0
Position               NaN
Age                   22.0
Height                 6-5
Weight               185.0
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

In [67]:
df.iloc[[3,5,7]]

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
R.J. Hunter,Boston Celtics,28.0,NaN,22.0,6-5,185.0,Georgia State,1148640.0
Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0

In [68]:
df.iloc[[3,5], [2,4]]

             Position Height
Name
R.J. Hunter       NaN    6-5
Amir Johnson       PF    6-9

In [69]:
df.iloc[:, [2,5]]

              Position  Weight
Name
Avery Bradley       PG   180.0
Jae Crowder         SF   235.0
John Holland        SG   205.0
R.J. Hunter        NaN   185.0
Jonas Jerebko       PF   231.0
...                ...     ...
Shelvin Mack        PG   203.0
Raul Neto           PG   179.0
Tibor Pleiss         C   256.0
Jeff Withey          C   231.0
NaN                NaN     NaN

[458 rows x 2 columns]

In [70]:
df.head()

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,NaN,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,NaN,6-10,231.0,NaN,5000000.0

In [71]:
df.tail()

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [72]:
df.at["Tibor Pleiss", "Number"]

np.float64(21.0)

In [73]:
df.query("Age > 29 and College == 'Duke'")

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Elton Brand,Philadelphia 76ers,42.0,PF,37.0,6-9,254.0,Duke,NaN
JJ Redick,Los Angeles Clippers,4.0,SG,31.0,6-4,190.0,Duke,7085000.0
Mike Dunleavy,Chicago Bulls,34.0,SG,35.0,6-9,230.0,Duke,4500000.0
Dahntay Jones,Cleveland Cavaliers,30.0,SG,35.0,6-6,225.0,Duke,NaN
Luol Deng,Miami Heat,9.0,SF,31.0,6-9,220.0,Duke,10151612.0

In [74]:
data_dict = {"name": ["aparna", "pankaj", "sudhir", "Greeku"], "degree": ["MBA", "BCA", "M.Tech", "MBA"], "score": [90, 40, 80, 98]}
df = pd.DataFrame(data_dict, index=[True, False, True, False])
df

         name  degree  score
True   aparna     MBA     90
False  pankaj     BCA     40
True   sudhir  M.Tech     80
False  Greeku     MBA     98

In [75]:
df.loc[True]

        name  degree  score
True  aparna     MBA     90
True  sudhir  M.Tech     80

In [76]:
df.iloc[1]

name      pankaj
degree       BCA
score         40
Name: False, dtype: object

In [77]:
df

         name  degree  score
True   aparna     MBA     90
False  pankaj     BCA     40
True   sudhir  M.Tech     80
False  Greeku     MBA     98

In [78]:
df = pd.DataFrame(data_dict, index=[0,1,2,3])
df[[True, False, True, False]]

     name  degree  score
0  aparna     MBA     90
2  sudhir  M.Tech     80

In [79]:
df["degree"] == "MBA"

0     True
1    False
2    False
3     True
Name: degree, dtype: bool

In [80]:
df['score'] > 80

0     True
1    False
2    False
3     True
Name: score, dtype: bool

In [81]:
df.index == 0

array([ True, False, False, False])

In [82]:
df.index > 2

array([False, False, False,  True])

In [83]:
df = pd.read_csv('../../datasets/nba.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      456 non-null    object
 2   Number    457 non-null    float64
 3   Position  456 non-null    object
 4   Age       456 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [84]:
df.dropna(inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 363 entries, 0 to 456
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      363 non-null    object
 1   Team      363 non-null    object
 2   Number    363 non-null    float64
 3   Position  363 non-null    object
 4   Age       363 non-null    float64
 5   Height    363 non-null    object
 6   Weight    363 non-null    float64
 7   College   363 non-null    object
 8   Salary    363 non-null    float64
dtypes: float64(4), object(5)
memory usage: 28.4+ KB

In [85]:
df["Salary"] = df["Salary"].astype(str)

In [86]:
df["sl"] = df["Salary"].str.slice(0, -2, 1)

In [87]:
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,sl
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,7730337
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,6796117
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0,1170960
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0,2165160
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0,1824360
...,...,...,...,...,...,...,...,...,...,...
449,Rodney Hood,Utah Jazz,5.0,SG,23.0,6-8,206.0,Duke,1348440.0,1348440
451,Chris Johnson,Utah Jazz,23.0,SF,26.0,6-6,206.0,Dayton,981348.0,981348
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0,2239800
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0,2433333
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0,947276

In [88]:
df['n'] = df["Name"].str.slice(0, -2, 2)

In [89]:
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,sl,n
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,7730337,AeyBal
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,6796117,JeCod
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0,1170960,Jra ik
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0,2165160,KlyOy
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0,1824360,TryRz
...,...,...,...,...,...,...,...,...,...,...,...
449,Rodney Hood,Utah Jazz,5.0,SG,23.0,6-8,206.0,Duke,1348440.0,1348440,Rde o
451,Chris Johnson,Utah Jazz,23.0,SF,26.0,6-6,206.0,Dayton,981348.0,981348,CrsJhs
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0,2239800,Te y
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0,2433333,SevnM
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0,947276,Jf ih

In [90]:
data_dict = {"a": [1,2,3,4,5,6,7], "b": [2,3,4,2,3,4,5], "c": [3,4,5,2,3,4,5], "d": [4,5,6,2,3,4,5], "e": [5,6,7,2,3,4,5]}
df = pd.DataFrame(data_dict)
df

   a  b  c  d  e
0  1  2  3  4  5
1  2  3  4  5  6
2  3  4  5  6  7
3  4  2  2  2  2
4  5  3  3  3  3
5  6  4  4  4  4
6  7  5  5  5  5

In [91]:
df2 = df.reindex(columns=['c', 'b'])
df2

   c  b
0  3  2
1  4  3
2  5  4
3  2  2
4  3  3
5  4  4
6  5  5

In [92]:
df3 = df.loc[:, "b":"d":2]
df3

   b  d
0  2  4
1  3  5
2  4  6
3  2  2
4  3  3
5  4  4
6  5  5

In [93]:
df4 = df.loc[:, "c":"e":1]

In [94]:
df4

   c  d  e
0  3  4  5
1  4  5  6
2  5  6  7
3  2  2  2
4  3  3  3
5  4  4  4
6  5  5  5

In [95]:
df.iloc[:, 1:3:1]

   b  c
0  2  3
1  3  4
2  4  5
3  2  2
4  3  3
5  4  4
6  5  5

In [96]:
df.iloc[:, 0:3:2]

   a  c
0  1  3
1  2  4
2  3  5
3  4  2
4  5  3
5  6  4
6  7  5

In [97]:
df = pd.read_csv("../../datasets/stock.csv")
df

      Stock Price
0           50.12
1           54.10
2           54.65
3           52.38
4           52.95
...           ...
3007       772.88
3008       771.07
3009       773.18
3010       771.61
3011       782.22

[3012 rows x 1 columns]

In [98]:
def func_stock_price(price):
    if price < 200:
        return "Low"
    elif price >= 200 and price < 400:
        return "Normal"
    else:
        return "High"

In [99]:
df = pd.DataFrame({"A": [1,2,3,4,5], "B": [11,12,13,14,15], "C": [21,22,23,24,25], "D": [31,32,33,34,35]})
df.mean(axis=0)

A     3.0
B    13.0
C    23.0
D    33.0
dtype: float64

In [100]:
df

   A   B   C   D
0  1  11  21  31
1  2  12  22  32
2  3  13  23  33
3  4  14  24  34
4  5  15  25  35

In [101]:
df.mean(axis=1)

0    16.0
1    17.0
2    18.0
3    19.0
4    20.0
dtype: float64

In [102]:
df.mean(axis=1, skipna=True)

0    16.0
1    17.0
2    18.0
3    19.0
4    20.0
dtype: float64

In [103]:
df

   A   B   C   D
0  1  11  21  31
1  2  12  22  32
2  3  13  23  33
3  4  14  24  34
4  5  15  25  35

In [104]:
df = pd.read_csv('../../datasets/nba.csv')
df['Team'].value_counts()

Team
New Orleans Pelicans      19
Memphis Grizzlies         18
New York Knicks           16
Milwaukee Bucks           16
Toronto Raptors           15
Boston Celtics            15
Chicago Bulls             15
Los Angeles Lakers        15
Phoenix Suns              15
Sacramento Kings          15
Detroit Pistons           15
Philadelphia 76ers        15
Golden State Warriors     15
Los Angeles Clippers      15
Miami Heat                15
Indiana Pacers            15
Cleveland Cavaliers       15
Dallas Mavericks          15
Houston Rockets           15
San Antonio Spurs         15
Atlanta Hawks             15
Charlotte Hornets         15
Utah Jazz                 15
Washington Wizards        15
Denver Nuggets            15
Oklahoma City Thunder     15
Portland Trail Blazers    15
Brooklyn Nets             14
Orlando Magic             14
Minnesota Timberwolves    14
Name: count, dtype: int64

In [105]:
df.assign(short_name =lambda x:x['Name'], inplace=True)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,short_name,inplace
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,Avery Bradley,True
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,Jae Crowder,True
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,John Holland,True
3,R.J. Hunter,Boston Celtics,28.0,NaN,22.0,6-5,185.0,Georgia State,1148640.0,R.J. Hunter,True
4,Jonas Jerebko,Boston Celtics,8.0,PF,NaN,6-10,231.0,NaN,5000000.0,Jonas Jerebko,True
...,...,...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0,Shelvin Mack,True
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0,Raul Neto,True
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0,Tibor Pleiss,True
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0,Jeff Withey,True
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,True

In [106]:
df.assign(hw=lambda x:x['Age'] * x['Weight'], inplace=True)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,hw,inplace
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,4500.0,True
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,5875.0,True
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,5535.0,True
3,R.J. Hunter,Boston Celtics,28.0,NaN,22.0,6-5,185.0,Georgia State,1148640.0,4070.0,True
4,Jonas Jerebko,Boston Celtics,8.0,PF,NaN,6-10,231.0,NaN,5000000.0,NaN,True
...,...,...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0,5278.0,True
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0,4296.0,True
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0,6656.0,True
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0,6006.0,True
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,True

In [107]:
df=df.apply(lambda x: np.square(x) if x.name == 'Utah Jazz' else 'koti', axis=1)

In [108]:
df

0      koti
1      koti
2      koti
3      koti
4      koti
       ...
453    koti
454    koti
455    koti
456    koti
457    koti
Length: 458, dtype: object

In [109]:
data = [[15, 2.5, 100], [20, 4.5, 50], [25, 5.2, 80], [45, 5.8, 48], [40, 6.3, 70], [41, 6.4, 90], [51, 2.3, 111]]
df = pd.DataFrame(data, columns=['Field_1', 'Field_2', 'Field_3'], index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])
df

   Field_1  Field_2  Field_3
a       15      2.5      100
b       20      4.5       50
c       25      5.2       80
d       45      5.8       48
e       40      6.3       70
f       41      6.4       90
g       51      2.3      111

In [110]:
df = df.apply(lambda x: np.square(x) if x.name in ['a', 'e', 'g'] else x, axis=1)
df

   Field_1  Field_2  Field_3
a    225.0     6.25  10000.0
b     20.0     4.50     50.0
c     25.0     5.20     80.0
d     45.0     5.80     48.0
e   1600.0    39.69   4900.0
f     41.0     6.40     90.0
g   2601.0     5.29  12321.0

In [111]:
df = df.apply(lambda x: np.square(x) if x.name in ['b', 'f'] else x, axis=0)
df

   Field_1  Field_2  Field_3
a    225.0     6.25  10000.0
b     20.0     4.50     50.0
c     25.0     5.20     80.0
d     45.0     5.80     48.0
e   1600.0    39.69   4900.0
f     41.0     6.40     90.0
g   2601.0     5.29  12321.0

In [112]:
df = df.assign(new_col=lambda x: (x['Field_1'] * x['Field_2'] * x['Field_3']))
df

   Field_1  Field_2  Field_3       new_col
a    225.0     6.25  10000.0  1.406250e+07
b     20.0     4.50     50.0  4.500000e+03
c     25.0     5.20     80.0  1.040000e+04
d     45.0     5.80     48.0  1.252800e+04
e   1600.0    39.69   4900.0  3.111696e+08
f     41.0     6.40     90.0  2.361600e+04
g   2601.0     5.29  12321.0  1.695282e+08

In [113]:
data = {"Name": ['Pandas', 'Geeks', 'for', 'Geeks_2'], "Height": [1,2,3,4], "Qualification": ['A', 'B', 'C', 'D']}
df = pd.DataFrame(data)
df

      Name  Height Qualification
0   Pandas       1             A
1    Geeks       2             B
2      for       3             C
3  Geeks_2       4             D

In [114]:
df['Address'] = ['NewYork', 'Chicago', 'Boston', 'Miami']
df

      Name  Height Qualification  Address
0   Pandas       1             A  NewYork
1    Geeks       2             B  Chicago
2      for       3             C   Boston
3  Geeks_2       4             D    Miami

In [115]:
df = df.assign(new_add=['NewYork', 'Chicago', 'Boston', 'Miami'])
df

      Name  Height Qualification  Address  new_add
0   Pandas       1             A  NewYork  NewYork
1    Geeks       2             B  Chicago  Chicago
2      for       3             C   Boston   Boston
3  Geeks_2       4             D    Miami    Miami

In [116]:
address_dict = {"Pandas": "NewYork", "Geeks": "Chicago", "for": "Boston", "Geek_2": "Miami"}
df['add'] = df['Name'].map(address_dict)
df

      Name  Height Qualification  Address  new_add      add
0   Pandas       1             A  NewYork  NewYork  NewYork
1    Geeks       2             B  Chicago  Chicago  Chicago
2      for       3             C   Boston   Boston   Boston
3  Geeks_2       4             D    Miami    Miami      NaN

In [117]:
new_columns = {"Age": [21, 22,23,24], "City": ['ny', 'la', 'sf', 'dc']}
df=df.assign(**new_columns)
df

      Name  Height Qualification  Address  new_add      add  Age City
0   Pandas       1             A  NewYork  NewYork  NewYork   21   ny
1    Geeks       2             B  Chicago  Chicago  Chicago   22   la
2      for       3             C   Boston   Boston   Boston   23   sf
3  Geeks_2       4             D    Miami    Miami      NaN   24   dc

In [118]:
df.insert(2, 'eof', [1,2,3,4], True)
df

      Name  Height  eof Qualification  Address  new_add      add  Age City
0   Pandas       1    1             A  NewYork  NewYork  NewYork   21   ny
1    Geeks       2    2             B  Chicago  Chicago  Chicago   22   la
2      for       3    3             C   Boston   Boston   Boston   23   sf
3  Geeks_2       4    4             D    Miami    Miami      NaN   24   dc

In [119]:
df.loc[df['Height'] >= 3, 'Category'] = 'Tall'

In [120]:
df

,Name,Height,eof,Qualification,Address,new_add,add,Age,City,Category
0,Pandas,1,1,A,NewYork,NewYork,NewYork,21,ny,NaN
1,Geeks,2,2,B,Chicago,Chicago,Chicago,22,la,NaN
2,for,3,3,C,Boston,Boston,Boston,23,sf,Tall
3,Geeks_2,4,4,D,Miami,Miami,NaN,24,dc,Tall

In [121]:
df = pd.read_csv('../../datasets/nba.csv', index_col='Name')
df

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,NaN,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,NaN,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [122]:
df.drop(['Avery Bradley', 'John Holland', 'R.J. Hunter'], inplace=True)
df

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
Jonas Jerebko,Boston Celtics,8.0,PF,NaN,6-10,231.0,NaN,5000000.0
Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
...,...,...,...,...,...,...,...,...
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [123]:
df.drop(['Team', 'Weight'], axis=1, inplace=True)

In [124]:
df

               Number Position   Age Height    College      Salary
Name
Jae Crowder      99.0       SF  25.0    6-6  Marquette   6796117.0
Jonas Jerebko     8.0       PF   NaN   6-10        NaN   5000000.0
Amir Johnson     90.0       PF  29.0    6-9        NaN  12000000.0
Jordan Mickey    55.0       PF  21.0    6-8        LSU   1170960.0
Kelly Olynyk     41.0        C  25.0    7-0    Gonzaga   2165160.0
...               ...      ...   ...    ...        ...         ...
Shelvin Mack      8.0       PG  26.0    6-3     Butler   2433333.0
Raul Neto        25.0       PG  24.0    6-1        NaN    900000.0
Tibor Pleiss     21.0        C  26.0    7-3        NaN   2900000.0
Jeff Withey      24.0        C  26.0    7-0     Kansas    947276.0
NaN               NaN      NaN   NaN    NaN        NaN         NaN

[455 rows x 6 columns]

In [125]:
data = {"Weight": [45,88,56,15,71], "Name": ["Sam", "Andrea", "Alex", "Robin", "Kia"], "Age": [14, 25, 55, 8, 21]}
df = pd.DataFrame(data)
index_ = pd.date_range('2024-10-31 09:50', periods=5, freq='H')
df.index=index_
df

C:\Users\464_0743\AppData\Local\Temp\ipykernel_5088\2175367203.py:3: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  index_ = pd.date_range('2024-10-31 09:50', periods=5, freq='H')

                     Weight    Name  Age
2024-10-31 09:50:00      45     Sam   14
2024-10-31 10:50:00      88  Andrea   25
2024-10-31 11:50:00      56    Alex   55
2024-10-31 12:50:00      15   Robin    8
2024-10-31 13:50:00      71     Kia   21

In [126]:
df=df.truncate(before='2024-10-31 10:50:00')
df

                     Weight    Name  Age
2024-10-31 10:50:00      88  Andrea   25
2024-10-31 11:50:00      56    Alex   55
2024-10-31 12:50:00      15   Robin    8
2024-10-31 13:50:00      71     Kia   21

In [127]:
sr = pd.Series([1,2,3,4,5,6])
sr

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [128]:
sr.truncate(before=2)

2    3
3    4
4    5
5    6
dtype: int64

In [129]:
df = pd.DataFrame({'name': ["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score': [90, 40, 80, 98]})
df

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [130]:
for i, j in df.iterrows():
    print(i, j)
    print()

0 name      aparna
degree       MBA
score         90
Name: 0, dtype: object

1 name      pankaj
degree       BCA
score         40
Name: 1, dtype: object

2 name      sudhir
degree    M.Tech
score         80
Name: 2, dtype: object

3 name      Geeku
degree      MBA
score        98
Name: 3, dtype: object

In [131]:
df = pd.DataFrame({'name': ["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score': [90, 40, 80, 98]})
for i in df.itertuples():
    print(i)

Pandas(Index=0, name='aparna', degree='MBA', score=90)
Pandas(Index=1, name='pankaj', degree='BCA', score=40)
Pandas(Index=2, name='sudhir', degree='M.Tech', score=80)
Pandas(Index=3, name='Geeku', degree='MBA', score=98)

In [132]:
columns = list(df)
columns

['name', 'degree', 'score']

In [133]:
for i in columns:
    print(df[i][2])

sudhir
M.Tech
80

In [134]:
df = pd.read_csv('../../datasets/nba.csv')
df.sort_values('Name', axis=0, ascending=True, inplace=True, na_position='last')
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
152,Aaron Brooks,Chicago Bulls,0.0,PG,31.0,6-0,161.0,Oregon,2250000.0
356,Aaron Gordon,Orlando Magic,0.0,PF,20.0,6-9,220.0,Arizona,4171680.0
328,Aaron Harrison,Charlotte Hornets,9.0,SG,21.0,6-6,210.0,Kentucky,525093.0
404,Adreian Payne,Minnesota Timberwolves,33.0,PF,25.0,6-10,237.0,Michigan State,1938840.0
312,Al Horford,Atlanta Hawks,15.0,C,30.0,6-10,245.0,Florida,12000000.0
...,...,...,...,...,...,...,...,...,...
270,Xavier Munford,Memphis Grizzlies,14.0,PG,24.0,6-3,180.0,Rhode Island,NaN
402,Zach LaVine,Minnesota Timberwolves,8.0,PG,21.0,6-5,189.0,UCLA,2148360.0
271,Zach Randolph,Memphis Grizzlies,50.0,PF,34.0,6-9,260.0,Michigan State,9638555.0
237,Zaza Pachulia,Dallas Mavericks,27.0,C,32.0,6-11,275.0,NaN,5200000.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [135]:
df.sort_values(['Team', 'Name'], axis=0, ascending=True, inplace=True)
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
312,Al Horford,Atlanta Hawks,15.0,C,30.0,6-10,245.0,Florida,12000000.0
318,Dennis Schroder,Atlanta Hawks,17.0,PG,22.0,6-1,172.0,NaN,1763400.0
323,Jeff Teague,Atlanta Hawks,0.0,PG,27.0,6-2,186.0,Wake Forest,8000000.0
309,Kent Bazemore,Atlanta Hawks,24.0,SF,26.0,6-5,201.0,Old Dominion,2000000.0
311,Kirk Hinrich,Atlanta Hawks,12.0,SG,35.0,6-4,190.0,Kansas,2854940.0
...,...,...,...,...,...,...,...,...,...
375,Nene Hilario,Washington Wizards,42.0,C,33.0,6-11,250.0,NaN,13000000.0
378,Otto Porter Jr.,Washington Wizards,22.0,SF,23.0,6-8,198.0,Georgetown,4662960.0
379,Ramon Sessions,Washington Wizards,7.0,PG,30.0,6-3,190.0,Nevada,2170465.0
15,Bojan Bogdanovic,NaN,44.0,SG,27.0,6-8,216.0,NaN,3425510.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [136]:
data = {"Name": ["Alice", "Bob"], "Age": [25, 30]}
df = pd.DataFrame(data)
len(df)

2

In [137]:
df

    Name  Age
0  Alice   25
1    Bob   30

In [138]:
df.loc[len(df)] = ['a', 30]
df

    Name  Age
0  Alice   25
1    Bob   30
2      a   30

In [139]:
df1=pd.DataFrame({"Name": ['c', 'd'], "Age": [12, 13]})
df = pd.concat([df, df1], ignore_index=True)
df

    Name  Age
0  Alice   25
1    Bob   30
2      a   30
3      c   12
4      d   13

In [140]:
data = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'],
        'Age':[27, 24, 22, 32,
               33, 36, 27, 32],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']}
df=pd.DataFrame(data)
df

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

In [141]:
df.groupby('Name').groups

{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2], 'Princi': [3, 6]}

In [142]:
df.groupby(['Name', 'Age']).groups

{('Abhi', 32): [7], ('Anuj', 24): [1], ('Anuj', 36): [5], ('Gaurav', 33): [4], ('Jai', 22): [2], ('Jai', 27): [0], ('Princi', 27): [6], ('Princi', 32): [3]}

In [143]:
df.groupby('Name')['Age'].sum()

Name
Abhi      32
Anuj      60
Gaurav    33
Jai       49
Princi    59
Name: Age, dtype: int64

In [144]:
df.groupby(['Name'], sort=False)['Age'].sum()

Name
Jai       49
Anuj      60
Princi    59
Gaurav    33
Abhi      32
Name: Age, dtype: int64

In [145]:
data = {'Team':['Arsenal', 'Manchester United', 'Arsenal',
                   'Arsenal', 'Chelsea', 'Manchester United',
                   'Manchester United', 'Chelsea', 'Chelsea', 'Chelsea'],
                   
           'Player':['Ozil', 'Pogba', 'Lucas', 'Aubameyang',
                       'Hazard', 'Mata', 'Lukaku', 'Morata', 
                                         'Giroud', 'Kante'],
                                         
           'Goals':[5, 3, 6, 4, 9, 2, 0, 5, 2, 3] }

df = pd.DataFrame(data)
df

                Team      Player  Goals
0            Arsenal        Ozil      5
1  Manchester United       Pogba      3
2            Arsenal       Lucas      6
3            Arsenal  Aubameyang      4
4            Chelsea      Hazard      9
5  Manchester United        Mata      2
6  Manchester United      Lukaku      0
7            Chelsea      Morata      5
8            Chelsea      Giroud      2
9            Chelsea       Kante      3

In [146]:
df['Goals'].groupby(df['Team']).mean()

Team
Arsenal              5.000000
Chelsea              4.750000
Manchester United    1.666667
Name: Goals, dtype: float64

In [147]:
data = {
    'Store': ['A', 'A', 'B', 'B', 'A', 'B'],
    'Product': ['Apple', 'Banana', 'Apple', 'Banana', 'Apple', 'Banana'],
    'Sales': [100, 150, 200, 100, 120, 180],
    'Quantity': [10, 20, 30, 40, 15, 35]
}

df = pd.DataFrame(data)
df.groupby('Store').agg({'Sales': 'sum', 'Quantity': 'mean'})

       Sales  Quantity
Store
A        370      15.0
B        480      35.0

In [148]:
data1 = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age': [27, 24, 22, 32],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Msc', 'MA', 'MCA', 'Phd']}

data2 = {'Name': ['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'],
         'Age': [17, 14, 12, 52],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Btech', 'B.A', 'Bcom', 'B.hons']}

df = pd.DataFrame(data1, index=[0, 1, 2, 3])

df1 = pd.DataFrame(data2, index=[4, 5, 6, 7])
df_new = pd.concat([df, df1])
df_new

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

In [149]:
data1 = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age': [27, 24, 22, 32],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Msc', 'MA', 'MCA', 'Phd'],
         'Mobile No': [97, 91, 58, 76]}

data2 = {'Name': ['Gaurav', 'Anuj', 'Dhiraj', 'Hitesh'],
         'Age': [22, 32, 12, 52],
         'Address': ['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'],
         'Qualification': ['MCA', 'Phd', 'Bcom', 'B.hons'],
         'Salary': [1000, 2000, 3000, 4000]}

df = pd.DataFrame(data1, index=[0, 1, 2, 3])

df1 = pd.DataFrame(data2, index=[2, 3, 6, 7])
res2 = pd.concat([df, df1], axis=1, join='inner')
res2

,Name,Age,Address,Qualification,Mobile No,Name,Age,Address,Qualification,Salary
2,Gaurav,22,Allahabad,MCA,58,Gaurav,22,Allahabad,MCA,1000
3,Anuj,32,Kannuaj,Phd,76,Anuj,32,Kannuaj,Phd,2000

In [150]:
res3=pd.concat([df, df1], axis=1, sort=False)
res3

,Name,Age,Address,Qualification,Mobile No,Name,Age,Address,Qualification,Salary
0,Jai,27.0,Nagpur,Msc,97.0,NaN,NaN,NaN,NaN,NaN
1,Princi,24.0,Kanpur,MA,91.0,NaN,NaN,NaN,NaN,NaN
2,Gaurav,22.0,Allahabad,MCA,58.0,Gaurav,22.0,Allahabad,MCA,1000.0
3,Anuj,32.0,Kannuaj,Phd,76.0,Anuj,32.0,Kannuaj,Phd,2000.0
6,NaN,NaN,NaN,NaN,NaN,Dhiraj,12.0,Allahabad,Bcom,3000.0
7,NaN,NaN,NaN,NaN,NaN,Hitesh,52.0,Kannuaj,B.hons,4000.0

In [151]:
res4=pd.concat([df, df1], ignore_index=True)
res4

     Name  Age    Address Qualification  Mobile No  Salary
0     Jai   27     Nagpur           Msc       97.0     NaN
1  Princi   24     Kanpur            MA       91.0     NaN
2  Gaurav   22  Allahabad           MCA       58.0     NaN
3    Anuj   32    Kannuaj           Phd       76.0     NaN
4  Gaurav   22  Allahabad           MCA        NaN  1000.0
5    Anuj   32    Kannuaj           Phd        NaN  2000.0
6  Dhiraj   12  Allahabad          Bcom        NaN  3000.0
7  Hitesh   52    Kannuaj        B.hons        NaN  4000.0

In [152]:
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

df = pd.DataFrame(data1,index=[0, 1, 2, 3])

s1 = pd.Series([1000, 2000, 3000, 4000], name='Salary')
res = pd.concat([df, s1], axis=1)
res

     Name  Age    Address Qualification  Salary
0     Jai   27     Nagpur           Msc    1000
1  Princi   24     Kanpur            MA    2000
2  Gaurav   22  Allahabad           MCA    3000
3    Anuj   32    Kannuaj           Phd    4000

In [153]:
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],}

data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

df = pd.DataFrame(data1)

df1 = pd.DataFrame(data2)
res = pd.merge(df, df1, on='key')
res

  key    Name  Age    Address Qualification
0  K0     Jai   27     Nagpur         Btech
1  K1  Princi   24     Kanpur           B.A
2  K2  Gaurav   22  Allahabad          Bcom
3  K3    Anuj   32    Kannuaj        B.hons

In [154]:
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K1', 'K0', 'K1'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],}

data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K0', 'K0', 'K0'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

df = pd.DataFrame(data1)

df1 = pd.DataFrame(data2)
res1 = pd.merge(df, df1, on=['key', 'key1'])

res1

  key key1    Name  Age    Address Qualification
0  K0   K0     Jai   27     Nagpur         Btech
1  K2   K0  Gaurav   22  Allahabad          Bcom

In [155]:
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K1', 'K0', 'K1'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],}

data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K0', 'K0', 'K0'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

df = pd.DataFrame(data1)

df1 = pd.DataFrame(data2)

In [156]:
data1 = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age': [27, 24, 22, 32],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Msc', 'MA', 'MCA', 'Phd']}

data2 = {'Name': ['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'],
         'Age': [17, 14, 12, 52],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['B-Tech', 'B.A', 'Bcom', 'B.hons']}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
df = pd.concat([df1, df2])
df

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd
0    Abhi   17     Nagpur        B-Tech
1  Ayushi   14     Kanpur           B.A
2  Dhiraj   12  Allahabad          Bcom
3  Hitesh   52    Kannuaj        B.hons

In [157]:
res2 = pd.concat([df, df1], axis=1, sort=False)
res2

     Name  Age    Address Qualification    Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd    Anuj   32    Kannuaj           Phd
0    Abhi   17     Nagpur        B-Tech     Jai   27     Nagpur           Msc
1  Ayushi   14     Kanpur           B.A  Princi   24     Kanpur            MA
2  Dhiraj   12  Allahabad          Bcom  Gaurav   22  Allahabad           MCA
3  Hitesh   52    Kannuaj        B.hons    Anuj   32    Kannuaj           Phd

In [158]:
res = pd.concat([df, df1], ignore_index=True)
res

      Name  Age    Address Qualification
0      Jai   27     Nagpur           Msc
1   Princi   24     Kanpur            MA
2   Gaurav   22  Allahabad           MCA
3     Anuj   32    Kannuaj           Phd
4     Abhi   17     Nagpur        B-Tech
5   Ayushi   14     Kanpur           B.A
6   Dhiraj   12  Allahabad          Bcom
7   Hitesh   52    Kannuaj        B.hons
8      Jai   27     Nagpur           Msc
9   Princi   24     Kanpur            MA
10  Gaurav   22  Allahabad           MCA
11    Anuj   32    Kannuaj           Phd

In [159]:
df = pd.read_csv('../../datasets/nba.csv')
df["Name"]=df["Name"].str.cat(df["Team"], sep=", ")
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,"Avery Bradley, Boston Celtics",Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,"Jae Crowder, Boston Celtics",Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,"John Holland, Boston Celtics",Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,"R.J. Hunter, Boston Celtics",Boston Celtics,28.0,NaN,22.0,6-5,185.0,Georgia State,1148640.0
4,"Jonas Jerebko, Boston Celtics",Boston Celtics,8.0,PF,NaN,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,"Shelvin Mack, Utah Jazz",Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,"Raul Neto, Utah Jazz",Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,"Tibor Pleiss, Utah Jazz",Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,"Jeff Withey, Utah Jazz",Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [162]:
df["College"]=df["College"].str.cat(df["Team"], sep=", ", na_rep="No College")
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,"Avery Bradley, Boston Celtics",Boston Celtics,0.0,PG,25.0,6-2,180.0,"Texas, Boston Celtics, Boston Celtics",7730337.0
1,"Jae Crowder, Boston Celtics",Boston Celtics,99.0,SF,25.0,6-6,235.0,"Marquette, Boston Celtics, Boston Celtics",6796117.0
2,"John Holland, Boston Celtics",Boston Celtics,30.0,SG,27.0,6-5,205.0,"Boston University, Boston Celtics, Boston Celtics",NaN
3,"R.J. Hunter, Boston Celtics",Boston Celtics,28.0,NaN,22.0,6-5,185.0,"Georgia State, Boston Celtics, Boston Celtics",1148640.0
4,"Jonas Jerebko, Boston Celtics",Boston Celtics,8.0,PF,NaN,6-10,231.0,"No College, Boston Celtics, Boston Celtics",5000000.0
...,...,...,...,...,...,...,...,...,...
453,"Shelvin Mack, Utah Jazz",Utah Jazz,8.0,PG,26.0,6-3,203.0,"Butler, Utah Jazz, Utah Jazz",2433333.0
454,"Raul Neto, Utah Jazz",Utah Jazz,25.0,PG,24.0,6-1,179.0,"No College, Utah Jazz, Utah Jazz",900000.0
455,"Tibor Pleiss, Utah Jazz",Utah Jazz,21.0,C,26.0,7-3,256.0,"No College, Utah Jazz, Utah Jazz",2900000.0
456,"Jeff Withey, Utah Jazz",Utah Jazz,24.0,C,26.0,7-0,231.0,"Kansas, Utah Jazz, Utah Jazz",947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"No College, No College, No College",NaN